<?php
// +----------------------------------------------------------------------
// | Description: 数据库配置文件
// +----------------------------------------------------------------------
// | Author: orchief
// +----------------------------------------------------------------------
return [
    // 数据库类型
    'type'           => '\think\mongo\Connection',
    // 服务器地址
    'hostname'       => 'wx.e-xls.com.cn',
    // 数据库名
    'database'       => 'pshop',
    // 用户名
    'username'       => 'root',
    // 密码
    'password'       => 'root',
    // 端口
    'hostport'       => '2021',
    // 数据库连接参数
    'params'         => [],
    // 数据库编码默认采用utf8
    'charset'        => 'utf8',

];
